InformationRegisters/ЦветаОформления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦветаОформления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ЦветаОформления</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ЦветаОформления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦветаОформления/Forms/ФормаНастройки/Ext/Form/Module.bsl
// © Primus1C  05.11.2023  НАЧАЛО ►

Процедура ЗаполнитьДерево()

	НастройкиЭлементы = ДеревоНастроек.ПолучитьЭлементы();
	НастройкиЭлементы.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦветаОформления.Родитель,
	               |	ЦветаОформления.Ссылка КАК Настройка,
	               |	ЦветаОформления.ЭтоГруппа КАК ЭтоГруппа,
	               |	НЕ ЦветаОформления.ЭтоГруппа КАК НомерКартинки,
	               |	ВЫРАЗИТЬ(Сведения.Значение КАК СТРОКА(13)) КАК Значение
	               |ИЗ
	               |	ПланВидовХарактеристик.ЦветаОформления КАК ЦветаОформления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦветаОформления КАК Сведения
	               |		ПО (Сведения.Настройка = ЦветаОформления.Ссылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоГруппа ИЕРАРХИЯ,
	               |	ЦветаОформления.Наименование";	
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ДобавитьСтрокиВДерево(Выборка, НастройкиЭлементы);
	
КонецПроцедуры

//По переданным данным создаем дерево строк на форме
//
// Выборка - выборка запроса с данными в иерархии
// ДеревоЗначени - элементы дерева значения, для которого создаются строки
//
Функция ДобавитьСтрокиВДерево(Выборка, ДеревоЗначений)
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаНастройки = ДеревоЗначений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНастройки, Выборка);
		НоваяСтрокаНастройки.Значение = Выборка.Настройка.ТипЗначения.ПривестиЗначение(Выборка.Значение);
		
		СтрокиВыборки = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Если СтрокиВыборки.Количество() > 0 Тогда
			
			ДобавитьСтрокиВДерево(СтрокиВыборки, НоваяСтрокаНастройки.ПолучитьЭлементы());
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции


// Процедура выполняет запись значений настроек в регистр сведений.
//
Процедура ОбновитьНастройки()
	
	НаборЗаписей = РегистрыСведений.ЦветаОформления.СоздатьНаборЗаписей();
	
	НастройкиГруппы = ДеревоНастроек.ПолучитьЭлементы();
	Для Каждого ГруппаНастроек Из НастройкиГруппы Цикл
		
		НастройкиЭлементы = ГруппаНастроек.ПолучитьЭлементы();
		
		Для Каждого СтрокаНастроек Из НастройкиЭлементы Цикл
			Запись = НаборЗаписей.Добавить();
			Запись.Настройка    = СтрокаНастроек.Настройка;
			Запись.Значение     = СтрокаНастроек.Настройка.ТипЗначения.ПривестиЗначение(СтрокаНастроек.Значение);
		КонецЦикла;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры // ОбновитьНастройки()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗаполнитьДерево();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ЦветаОформления.Настройка КАК Настройка,
	             |	ВЫРАЗИТЬ(ЦветаОформления.Значение КАК СТРОКА(13)) КАК Значение
	             |ИЗ
	             |	РегистрСведений.ЦветаОформления КАК ЦветаОформления
	             |ГДЕ
	             |	ЦветаОформления.Значение <> """"";  
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл  
		Эле = УсловноеОформление.Элементы.Добавить();
		Эле.Использование 	= Истина;
		Эле.Оформление.УстановитьЗначениеПараметра("ЦветФона", гоЦветРГБ(Выборка.Значение));    
		ЭлементУсловия                = Эле.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ДеревоНастроек.Значение");
		ЭлементУсловия.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементУсловия.ПравоеЗначение = Выборка.Значение;
		ЭлементУсловия.Использование  = Истина;
		ОформляемоеПоле      = Эле.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоНастроекНастройка");  
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗакрытии()

	ОбновитьНастройки();

КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные   = Элемент.ТекущиеДанные;   
	
	Если ТекущиеДанные = Неопределено ИЛИ ТекущиеДанные.ЭтоГруппа Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ТекПараметры    = Новый Структура("ТекущийЦвет", ТекущиеДанные.Значение);
	//ВыбранныйЦвет   = ОткрытьФормуМодально("Обработка.ДиалогВыбораЦвета.Форма.Форма", ТекПараметры, ЭтаФорма);

	//Если Не ВыбранныйЦвет = Неопределено Тогда
	//	Элемент.ТекущиеДанные.Значение = ВыбранныйЦвет; 
	//КонецЕсли;

	//СтандартнаяОбработка = Ложь;


	ОткрытьФорму("Обработка.ДиалогВыбораЦвета.Форма.Форма", ТекПараметры, ЭтаФорма, , , , 
		Новый ОписаниеОповещения("ДеревоНастроекПередНачаломИзмененияПослеВыбора", ЭтотОбъект, ТекущиеДанные));

    СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНастроекПередНачаломИзмененияПослеВыбора(ВыбранныйЦвет, ТекущиеДанные) Экспорт
    Если Не ВыбранныйЦвет = Неопределено Тогда
		ТекущиеДанные.Значение = ВыбранныйЦвет; 
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ДеревоНастроекЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВалютыНажатие(Элемент)
	ОткрытьФорму("Справочник.Валюты.ФормаСписка");
КонецПроцедуры

// © Primus1C  ОКОНЧАНИЕ ◄
